ИТ_Фирма/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИТ_Фирма/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

ИТ_Фирма/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)	
	//Корректное отображение организационно-правовых аббревиатур
	Если Не ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
		МассивНаименований = СтрРазделить(Объект.Наименование," ",Ложь);
		Аббревиатура = МассивНаименований.Получить(0);
		МассивНаименований.Удалить(0);
		НаименованиеБезАббревиатуры = Новый Массив();	
		
		Для Каждого ЭлементМассива Из МассивНаименований Цикл
			НаименованиеБезАббревиатуры.Добавить(ЭлементМассива);	
		КонецЦикла;	
		Если Аббревиатура = "АО" Тогда	
			Объект.ПолноеНаименование = "Акционерное общество " + СтрСоединить(НаименованиеБезАббревиатуры," ");
		ИначеЕсли Аббревиатура = "ИП" Тогда 	
			Объект.ПолноеНаименование = "Индивидуальный предприниматель " + СтрСоединить(НаименованиеБезАббревиатуры," ");
		ИначеЕсли Аббревиатура = "ООО" Тогда 	
			Объект.ПолноеНаименование = "Общество с ограниченной ответственностью " + СтрСоединить(НаименованиеБезАббревиатуры," ");	
		ИначеЕсли Аббревиатура = "УП" Тогда 	
			Объект.ПолноеНаименование = "Унитарное предприятие " + СтрСоединить(НаименованиеБезАббревиатуры," ");	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)
	
	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		
		Объект.КПП = Неопределено;
		Элементы.КПП.Видимость = Ложь;
	Иначе 
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе 
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры
